energia/cc13xx-core/system/source/ti/devices/cc26x0r2/inc/hw_adi_0_rf.h
// Field:   [4:0] TRIM_OUT
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFDLDO2_TRIM_OUT_W                                          5
#define ADI_0_RF_IFDLDO2_TRIM_OUT_M                                 0x0000001F
#define ADI_0_RF_IFDLDO2_TRIM_OUT_S                                          0

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFDLDO3
//
//*****************************************************************************
// Field:     [4] ATEST_V_EN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// EN                       Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFDLDO3_ATEST_V_EN                                 0x00000010
#define ADI_0_RF_IFDLDO3_ATEST_V_EN_M                               0x00000010
#define ADI_0_RF_IFDLDO3_ATEST_V_EN_S                                        4
#define ADI_0_RF_IFDLDO3_ATEST_V_EN_EN                              0x00000010
#define ADI_0_RF_IFDLDO3_ATEST_V_EN_DIS                             0x00000000

// Field:     [3] ATEST_I_EN
//
// Internal. Only to be used through TI provided API.
// ENUMs:
// EN                       Internal. Only to be used through TI provided API.
// DIS                      Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFDLDO3_ATEST_I_EN                                 0x00000008
#define ADI_0_RF_IFDLDO3_ATEST_I_EN_M                               0x00000008
#define ADI_0_RF_IFDLDO3_ATEST_I_EN_S                                        3
#define ADI_0_RF_IFDLDO3_ATEST_I_EN_EN                              0x00000008
#define ADI_0_RF_IFDLDO3_ATEST_I_EN_DIS                             0x00000000

// Field:   [2:0] COMP_RES
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFDLDO3_COMP_RES_W                                          3
#define ADI_0_RF_IFDLDO3_COMP_RES_M                                 0x00000007
#define ADI_0_RF_IFDLDO3_COMP_RES_S                                          0

//*****************************************************************************
//
// Register: ADI_0_RF_O_IFAMPCTL3
//
//*****************************************************************************
// Field:   [6:4] AAF_CAP_EN
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFAMPCTL3_AAF_CAP_EN_W                                      3
#define ADI_0_RF_IFAMPCTL3_AAF_CAP_EN_M                             0x00000070
#define ADI_0_RF_IFAMPCTL3_AAF_CAP_EN_S                                      4

// Field:   [3:0] IB
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_IFAMPCTL3_IB_W                                              4
#define ADI_0_RF_IFAMPCTL3_IB_M                                     0x0000000F
#define ADI_0_RF_IFAMPCTL3_IB_S                                              0

//*****************************************************************************
//
// Register: ADI_0_RF_O_STAT
//
//*****************************************************************************
// Field:   [7:3] IFADC_CALVAL_OUT
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_STAT_IFADC_CALVAL_OUT_W                                     5
#define ADI_0_RF_STAT_IFADC_CALVAL_OUT_M                            0x000000F8
#define ADI_0_RF_STAT_IFADC_CALVAL_OUT_S                                     3

// Field:     [2] IFADC_CALDONE
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_STAT_IFADC_CALDONE                                 0x00000004
#define ADI_0_RF_STAT_IFADC_CALDONE_M                               0x00000004
#define ADI_0_RF_STAT_IFADC_CALDONE_S                                        2

// Field:     [1] IFLDOS_RDY
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_STAT_IFLDOS_RDY                                    0x00000002
#define ADI_0_RF_STAT_IFLDOS_RDY_M                                  0x00000002
#define ADI_0_RF_STAT_IFLDOS_RDY_S                                           1

// Field:     [0] RF_LDO
//
// Internal. Only to be used through TI provided API.
#define ADI_0_RF_STAT_RF_LDO                                        0x00000001
#define ADI_0_RF_STAT_RF_LDO_M                                      0x00000001
#define ADI_0_RF_STAT_RF_LDO_S                                               0


#endif // __ADI_0_RF__
